КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_НастройкиПартнеров/КонтурЛогистика_НастройкиПартнеров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КонтурЛогистика_НастройкиПартнеров</name>
  <attributes>
    <name>ТипЗначения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПредопределенногоДляРасширения</name>
    <comment>В расширениях до 8.3.20 запрещено использовать предопределенные. Будем использовать это поле.</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Значение</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>Кастомная</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПрименимостьКПартнерам</name>
    <comment>чтобы понимать к каким ТК, сетям итд относится</comment>
    <attributes>
      <name>КодПартнераКонтур</name>
      <comment>Идентификатор партнера в сервисах ЭДО Контура. Не можем использовать ссылку иначе будут перекрестные</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоУмолчанию</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СценарииОтправкиТитулов</types>
        <types>CatalogRef.КонтурЛогистика_ОписанияОпасныхГрузов</types>
        <types>EnumRef.КонтурЛогистика_ОтветыПолучателяФайла</types>
        <types>EnumRef.КонтурЛогистика_ИнициаторыПереадресовки</types>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
        <types>EnumRef.КонтурЛогистика_Т1_РеквизитыТЧ</types>
        <types>EnumRef.КонтурЛогистика_НаправлениеКонвертации</types>
        <types>EnumRef.КонтурЛогистика_ТипыОшибокСтатусаТитула</types>
        <types>EnumRef.КонтурЛогистика_ТипыОсобенностейДокументооборота</types>
        <types>EnumRef.КонтурЛогистика_ВозможностиОформленияПередоверияМЧД</types>
        <types>EnumRef.КонтурЛогистика_ТипыПрокси</types>
        <types>EnumRef.КонтурЛогистика_ВидыКонтактнойИнформации</types>
        <types>EnumRef.КонтурЛогистика_СтатусыТитулов</types>
        <types>EnumRef.КонтурЛогистика_ВариантыФильтрации</types>
        <types>EnumRef.КонтурЛогистика_СтатусыПодписи</types>
        <types>EnumRef.КонтурЛогистика_ТипыЛиц</types>
        <types>EnumRef.КонтурЛогистика_ВариантыПодачиКонтейнера</types>
        <types>EnumRef.КонтурЛогистика_УровниДоступаСотрудника</types>
        <types>EnumRef.КонтурЛогистика_СпособыРасчетаЗначениейДокУчСист</types>
        <types>EnumRef.КонтурЛогистика_ФорматыФайловОбмена</types>
        <types>EnumRef.КонтурЛогистика_ПоляМаппинга_ТрН1</types>
        <types>EnumRef.КонтурЛогистика_СосотоянияФайловОбмена</types>
        <types>EnumRef.КонтурЛогистика_ТипыЛогистическихДокументов</types>
        <types>CatalogRef.КонтурЛогистика_Лицензии</types>
        <types>EnumRef.КонтурЛогистика_НастройкиПартнеров</types>
        <types>EnumRef.КонтурЛогистика_РеквизитыТитуловДляНастроекКонвертацииСправочников</types>
        <types>EnumRef.КонтурЛогистика_ФункцииЗаказаЗаявки</types>
        <types>EnumRef.КонтурЛогистика_СпособыПередачиМЧД</types>
        <types>Boolean</types>
        <types>EnumRef.КонтурЛогистика_Полномочия</types>
        <types>EnumRef.КонтурЛогистика_КаналыТранспорта</types>
        <types>EnumRef.КонтурЛогистика_СпособыКонвертации</types>
        <types>EnumRef.КонтурЛогистика_ВариантыРазделителя</types>
        <types>EnumRef.КонтурЛогистика_ВидыПутейСообщений</types>
        <types>EnumRef.КонтурЛогистика_СтавкиНДС</types>
        <types>EnumRef.КонтурЛогистика_ГруппыУпаковки</types>
        <types>EnumRef.КонтурЛогистика_ТипыПодписи</types>
        <types>EnumRef.КонтурЛогистика_ВариантыПроверкиПолномочийМЧД</types>
        <types>EnumRef.КонтурЛогистика_ВидыВладенияТранспортнымСредством</types>
        <types>EnumRef.КонтурЛогистика_МетодыОпределенияМассы</types>
        <types>EnumRef.КонтурЛогистика_СпецСценарииЗадач</types>
        <types>EnumRef.КонтурЛогистика_КатегорииОшибокОбъектов</types>
        <types>CatalogRef.КонтурЛогистика_МЧД</types>
        <types>EnumRef.КонтурЛогистика_ТребуемыеДействия</types>
        <types>EnumRef.КонтурЛогистика_ТипыПМ</types>
        <types>String</types>
        <types>EnumRef.КонтурЛогистика_СтороныСоставители</types>
        <types>EnumRef.КонтурЛогистика_ОтборыПоСостояниюЗадач</types>
        <types>EnumRef.КонтурЛогистика_РежимыАвторизации</types>
        <types>CatalogRef.КонтурЛогистика_Договоры</types>
        <types>EnumRef.КонтурЛогистика_СпособыСопоставленияТоваровТитул3</types>
        <types>Date</types>
        <types>Number</types>
        <types>EnumRef.КонтурЛогистика_ВидыЛицензий</types>
        <types>EnumRef.КонтурЛогистика_СценарииПодписанияТитулов</types>
        <types>EnumRef.КонтурЛогистика_СпособыПодтвержденияПолномочий</types>
        <types>CatalogRef.КонтурЛогистика_КлассификаторУпаковок</types>
        <types>EnumRef.КонтурЛогистика_СодержаниеОперацииЭстафеты</types>
        <types>EnumRef.КонтурЛогистика_КлассыОпасностиГрузов</types>
        <types>CatalogRef.КонтурЛогистика_ПунктыМаршрута</types>
        <types>EnumRef.КонтурЛогистика_СценарииАвтоматическойРаботы</types>
        <types>CatalogRef.КонтурЛогистика_КлассификаторПолномочийМЧД</types>
        <types>EnumRef.КонтурЛогистика_СпособыМаппингаПоля</types>
        <types>EnumRef.КонтурЛогистика_ПолномочияДействий</types>
        <types>EnumRef.КонтурЛогистика_ТрН_Реквизиты</types>
        <types>EnumRef.КонтурЛогистика_Т1_Реквизиты</types>
        <types>EnumRef.КонтурЛогистика_ТиповыеКонфигурации1С</types>
        <types>EnumRef.КонтурЛогистика_ФорматыМЧД</types>
        <types>EnumRef.КонтурЛогистика_СтатусыПодписанта</types>
        <types>EnumRef.КонтурЛогистика_ВидыПеревозки</types>
        <types>EnumRef.КонтурЛогистика_ВариантыПоискаУчетногоДокумента</types>
        <types>EnumRef.КонтурЛогистика_ТипыКонтактнойИнформации</types>
        <types>EnumRef.КонтурЛогистика_ТипыСопроводительныхДокументов</types>
        <types>EnumRef.КонтурЛогистика_НастройкиОрганизацийДиадок</types>
        <types>EnumRef.КонтурЛогистика_ВидыКоммерческихПеревозок</types>
        <types>EnumRef.КонтурЛогистика_Сценарии</types>
        <types>EnumRef.КонтурЛогистика_СтатусыСвязейДокументов</types>
        <types>EnumRef.КонтурЛогистика_СтатусыКонтрагентов</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

КАКерамика_моя_старая_база/src/Catalogs/КонтурЛогистика_НастройкиПартнеров/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда 
		Объект.Кастомная = Истина;
	КонецЕсли;
	
	ЭтоПользовательскаяНастройка = Объект.Кастомная;
	
	УстановитьТипЗначенияЭлементаЗначения();
	
	Элементы.ИмяПредопределенногоДляРасширения.ТолькоПросмотр 		= Не ЭтоПользовательскаяНастройка;
	
	ТекПользовательПродвинутый = (КонтурЛогистика_ОбщегоНазначенияСервер.ТекПользовательАдминистратор()
		Или РольДоступна("КонтурЛогистика_НастройкаПодсистемы"));
		
КонецПроцедуры

&НаСервере
Процедура УстановитьТипЗначенияЭлементаЗначения()
	
	Если Объект.Кастомная  Тогда
		
		Попытка
			
			Если ЗначениеЗаполнено(Объект.ТипЗначения) Тогда	
				МассивТипов = Новый Массив;
				МассивТипов.Добавить(Тип(Объект.ТипЗначения));
				ОписаниеТиповЗначения = Новый ОписаниеТипов(МассивТипов);
			Иначе
				ОписаниеТиповЗначения = Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная));
			КонецЕсли;
			
		Исключение
			
			ОписаниеТиповЗначения = Новый ОписаниеТипов("Строка", ,Новый КвалификаторыСтроки(255, ДопустимаяДлина.Переменная));
			
		КонецПопытки;
		
		Элемент = Элементы.Значение;
		Элемент.ОграничениеТипа = ОписаниеТиповЗначения;
		Элемент.ДоступныеТипы 	= ОписаниеТиповЗначения;
		Элемент.ВыбиратьТип 	= Ложь;		
		
		Объект.Значение 		= Элемент.ОграничениеТипа.ПривестиЗначение(Объект.Значение);
		
		Элементы.ТипЗначения.Вид = ВидПоляФормы.ПолеВвода;
		Элементы.Описание.РедактированиеТекста = Истина;
		Элементы.Наименование.РедактированиеТекста = Истина;
		
	Иначе	
		
		ОписаниеТиповЗначения = Новый ОписаниеТипов(Объект.ТипЗначения);
		
		Элемент = Элементы.Значение;
		Элемент.ОграничениеТипа = ОписаниеТиповЗначения; 
		Элемент.ДоступныеТипы 	= ОписаниеТиповЗначения;
		Элемент.ВыбиратьТип 	= Ложь;
		
		Объект.Значение 		= Элемент.ОграничениеТипа.ПривестиЗначение(Объект.Значение);
		
		Элементы.ТипЗначения.Вид = ВидПоляФормы.ПолеНадписи;
		Элементы.Описание.РедактированиеТекста = Ложь;
		Элементы.Наименование.РедактированиеТекста = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Если Объект.Кастомная Тогда
		
		СписокВыбора = КонтурЛогистика_ОбщегоНазначенияСервер.МассивТиповЗначенийЭлементов("Справочники", "Перечисления", "ПримитивныеТипы", "КонтурЛогистика_НастройкиПартнеров");		
		КонтурЛогистика_ОбщегоНазначенияКлиент.ВыбратьИзСписка_КонтурЛогистика(СписокВыбора, , ЭтаФорма, "ТипЗначенияНачалоВыбораЗавершение");	
		
	Иначе
		
		УстановитьТипЗначенияЭлементаЗначения();	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипЗначенияНачалоВыбораЗавершение(ВыбранныйЭлемент, ТекДанные) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.ТипЗначения = ВыбранныйЭлемент.Значение;
	УстановитьТипЗначенияЭлементаЗначения();
	
КонецПроцедуры
